<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Top 11 Wines of the Week</title>
<style type="text/css">
<!--
.style1 {
	font-family: Georgia, "Times New Roman", Times, serif;
	font-weight: bold;
	font-size: 36px;
}
.style2 {
	font-family: Arial, Helvetica, sans-serif;
	font-size: 12px;

}
.style5 {
	font-size: 18px;
	font-weight: bold;
}
.style8 {font-family: Arial, Helvetica, sans-serif; font-size: 12px; font-weight: bold; }
-->
</style>
</head>

<body>
<p><a href="http://www.astorwines.com">back to astorwines.com </a><div align="right"><A HREF="javascript:window.print()">Click to Print This Page</A></div></p>
<p><span class="style1">our top 11: </span><br />
    <span class="style2"><span class="style5">Rh&ocirc;ne Valley Wines </span> <br />
    (... we go to eleven)<br />
    <br />
  <strong>11.   </strong></span><span class="style2"><strong>C&ocirc;tes du Rh&ocirc;ne &quot;Grandes Vignes&quot;, D'Estezargues (2006) </strong></span><strong class="style2"> </strong><br />
  <span class="style2">This great wine from a Natural winemaker is full of dark fruit and a little bit smoky, with just a hint of game. Great now in the flush of youth but also has interesting medium-term aging potential.<br />
#26323<br />
  Sale Price: $10.19</span><br />
  <br />
  <span class="style2"><strong>10. Crozes-Hermitage &quot;La Matini&egrave;re&quot;, Ferraton (2004)</strong><br />
  Made entirely from Syrah grown in sand and limestone soils. The sand helps make for a soft and fruity Northern Rh&ocirc;ne wine. The fruit is abundant but soft in its approach. This is drinking very well today.<br />
  #16909<br />
  Sale Price: $15.29<br />
  <br />
  <strong>9. S&eacute;guret C&ocirc;tes du Rh&ocirc;ne, S&eacute;lection Laurence F&eacute;raud (2005) </strong><br />
  Coming from one of the newer declared villages of the Rh&ocirc;ne valley, this is a delicious C&ocirc;tes du Rh&ocirc;ne.  Earthy notes, with bright red fruit and juicy acidity.<br />
  #19385<br />
  Sale Price:   $16.99<br />
  <br />
  <strong>8. C&ocirc;tes du Rh&ocirc;ne, Ch. Du Mourre de Tendre (2003)</strong> <br />
  This is traditional C&ocirc;tes du Rh&ocirc;ne at its best.&nbsp; Made from old-vine Grenache,   Cinsault, and Carignan, this wine is aged for two years before being released   and does not see any filtration.&nbsp; Rich and concentrated, with notes of plum,   blackberry, and mocha.<br />
  #19595<br />
  Sale Price: $11.04<br />
  <br />
  <strong>7. Dom. de Fenouillet Ros&eacute;, C&ocirc;tes du Ventoux (2007)  </strong><br />
  A very pretty pink with a coppery tint, this wine bursts with melon flavors, stones, and just a touch of pepper spice. <br />
  #11887<br />
  Sale Price: $8.49<br />
  <br />
  <strong>6. Dom. Triennes Viognier, Ste. Fleur (2006) </strong><br />
  A fresh, dry white wine with apricot and peach floral aromas and lovely minerals   on the finish. This is a fruit-laden Viognier that you can enjoy tonight.<br />
  #15479<br />
  Sale Price: $12.74<br />
  <br />
  <strong>5. C&ocirc;te-R&ocirc;tie, &quot;Cuv&eacute;e Classique&quot;, Rostaing (2004) </strong><br />
  This entry-level cuv&eacute;e comes from Ren&eacute; Rostaing, one of the masters of the Northern Rh&ocirc;ne.   The Cuv&eacute;e Classique is a blend of grapes from different vineyards in the C&ocirc;te-R&ocirc;tie. Dark blueberry, tobacco, and brambly tannins characterize this wine.<br />
  #16330<br />
  Sale Price:   $42.49<br />
  <br />
  <strong>4. Crozes-Hermitage, &quot;Les Jalets,&quot; Jaboulet (2005) </strong><br />
  Soft and rich with spicy blackcurrant flavor, this value-driven Rh&ocirc;ne red is made by noted producer Paul Jaboulet-A&icirc;n&eacute;. Some of the Syrah is sourced from younger vines that are grown in the same soil as the superb Thalabert Crozes-Hermitage.<br />
  #24484<br />
  Sale Price: $16.99<br />
  <br />
  <strong>3. Ermitage &quot;Les Dionni&egrave;res&quot;, Ferraton (1999) </strong> <br />
  One of those tight and brooding reds that's made for the cellar. This one is just beginning to evolve. Full of leather, spicebox, blackcurrants and limey minerals. The tannins are elegant and silken. <br />
  #16910<br />
  Sale Price: $52.69<br />
  <br />
  <strong>2. C&ocirc;tes du Rh&ocirc;ne &quot;Cuv&eacute;e de la Pierre Chaud&quot;, L'Anglore (2006) </strong><br />
Made from Grenache by natural winemaker Eric Pfifferling. A prominent floral nose leads to freshly macerated mixed berries on the palate. This wine is made without the addition of sulphur, allowing it to retain a rare purity and cleanness of flavor. Delicious.<br />
  #14099<br />
  Sale Price: $16.99 <br />
  <br />
  <strong>1.</strong> </span><span class="style8">Syrah, Herv&eacute; Souhaut (2006) </span><span class="style2"><br />
  Herv&eacute; Souhaut makes wine west of the St.-Joseph sub-region of the Northern Rh&ocirc;ne Valley.  He uses the Syrah grape, striving at every turn to preserve its natural fruit character. Dark berried fruits on the palate lead to violets and eucalyptus on the finish. This is a fresh, unadulterated, and profoundly complex red wine.<br />
  #14105<br />
  Sale Price: </span><span class="style2">$21.24</span></p>
</body>
</html>
